api-definitions/openapi/examples/ReqPaGetPayment.xml

<soapenv:Envelope xmlns:pafn="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <pafn:paGetPaymentReq>
         <idPA>77777777777</idPA>
         <idBrokerPA>77777777777</idBrokerPA>
         <idStation>77777777777_01</idStation>
         <qrCode>
            <fiscalCode>77777777777</fiscalCode>
            <noticeNumber>311018921337126000</noticeNumber>
         </qrCode>
         <amount>10.00</amount>
      </pafn:paGetPaymentReq>
   </soapenv:Body>
</soapenv:Envelope>