tests/template/resp/paSendRT.tpl

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <a:paSendRTRes xmlns:a="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
            <outcome>OK</outcome>
        </a:paSendRTRes>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>