src/test/resources/requests/paSendRTV2Request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no" ?>
<soapenv:Envelope
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:tns="http://pagopa-api.pagopa.gov.it/paForNode"
	xmlns:common="http://pagopa-api.pagopa.gov.it/xsd/common-types/v1.0.0/"
	xmlns:pafn="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
	<soapenv:Body>
		<pafn:paSendRTV2Request>
			<idPA>15376371009</idPA>
			<idBrokerPA>15376371009</idBrokerPA>
			<idStation>15376371009_48</idStation>
			<receipt>
				<receiptId>a0fffc676950472c94ca8e1456dc7b03</receiptId>
				<noticeNumber>348172725623804858</noticeNumber>
				<fiscalCode>15376371009</fiscalCode>
				<outcome>OK</outcome>
				<creditorReferenceId>863965926210520</creditorReferenceId>
				<paymentAmount>16.00</paymentAmount>
				<description>/RFB/863965926210520/16.00/TXT/DEBITORE/JHNDOE00A01F205N</description>
				<companyName>PagoPA S.p.A.</companyName>
				<debtor>
					<uniqueIdentifier>
						<entityUniqueIdentifierType>M</entityUniqueIdentifierType>
						<entityUniqueIdentifierValue>JHNDOE00A01F205N</entityUniqueIdentifierValue>
					</uniqueIdentifier>
					<fullName>John Doe</fullName>
					<streetName>Via qualsiasi</streetName>
					<civicNumber>1</civicNumber>
					<postalCode>00100</postalCode>
					<city>Roma</city>
					<stateProvinceRegion>RM</stateProvinceRegion>
					<country>IT</country>
					<e-mail>john.doe@test.it</e-mail>
				</debtor>
				<transferList>
					<transfer>
						<idTransfer>1</idTransfer>
						<transferAmount>16.00</transferAmount>
						<fiscalCodePA>77777777777</fiscalCodePA>
						<companyName></companyName>
						<MBDAttachment>attachment</MBDAttachment>
						<remittanceInformation>/RFB/863965926210520/16.00/TXT/DEBITORE/JHNDOE00A01F205N</remittanceInformation>
						<transferCategory>9/0301116TS</transferCategory>
						<metadata>
							<mapEntry>
								<key>DatiSpecificiRiscossione</key>
								<value>9/0301116TS/9/11111111111</value>
							</mapEntry>
						</metadata>
					</transfer>
				</transferList>
				<idPSP>BCITITMM</idPSP>
				<pspFiscalCode>88888888888</pspFiscalCode>
				<PSPCompanyName>Intesa Sanpaolo S.p.A</PSPCompanyName>
				<idChannel>88888888888_01</idChannel>
				<channelDescription>app</channelDescription>
				<paymentMethod>creditCard</paymentMethod>
				<paymentNote>734b9b88-6186-4034-a79e-813efacf36a0</paymentNote>
				<fee>0.35</fee>
				<paymentDateTime>2024-09-25T11:24:01</paymentDateTime>
				<applicationDate>2024-09-25</applicationDate>
				<transferDate>2024-09-26</transferDate>
			</receipt>
		</pafn:paSendRTV2Request>
	</soapenv:Body>
</soapenv:Envelope>